import { Gvar } from '../variable'
import * as Adap from '../adapter/index'
async function func290(this: any) {
        Adap.dbgprt(290);
        Gvar.var_1096 = 1;
        Gvar.var_1098 = 1;
        Gvar.var_1100 = 1;
        Gvar.var_1102 = 1;
        Gvar.var_1082 = 30; // X軸のマス数
        Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
        Gvar.var_983 =           "##############################"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "##########.###################";
        Gvar.var_983 = Gvar.var_983 + "##########...#################";
        Gvar.var_983 = Gvar.var_983 + "######........################"; // この辺がヴェネチアホテルのマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##########....################"; // ジッパーの位置 X軸=15、Y軸=21
        Gvar.var_983 = Gvar.var_983 + "#########^#...################";
        Gvar.var_983 = Gvar.var_983 + "#######.#.....################"; // この辺が亀のマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=8、Y軸=6
        Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
        Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        return;
}

export {func290}
